CSI API ETABS v1

# cLoadPatternsAutoWind Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cAutoWind AutoWind { get; }

    ReadOnly Property AutoWind As cAutoWind
    	Get

    Dim instance As cLoadPatterns
    Dim value As cAutoWind

    value = instance.AutoWind

    property cAutoWind^ AutoWind {
    	cAutoWind^ get ();
    }

    abstract AutoWind : cAutoWind with get

#### Property Value

Type: cAutoWind

See Also

#### Reference

cLoadPatterns Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com